#### Terraform Plan: ✅
<details>
<summary>Show</summary>
```terraform
[command]/home/runner/work/_temp/e567987f-ac0f-4aab-a42d-b6caa2e8d3da/terraform-bin plan -input=false
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/m9tvhw-dev/runs/run-HBZv7G6UVGzgegvJ

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...
random_integer.cf_origin_id: Refreshing state... [id=44]
random_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-learning-tetra]
module.network.data.aws_security_group.web: Reading...
module.network.data.aws_security_group.app: Reading...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:374838549618:cluster/sample-cluster]
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
module.network.data.aws_vpc.main: Reading...
data.aws_security_group.web: Reading...
module.network.data.aws_security_group.data: Reading...
aws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]
data.aws_caller_identity.current: Reading...
aws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]
data.aws_alb.main: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=374838549618]
aws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-learning-tetra]
module.network.data.aws_security_group.web: Read complete after 1s [id=sg-06d97327bc33be89f]
aws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:374838549618:startup-sample-billing-alert-topic]
aws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=ELQYSL4L90Q8Q]
data.aws_security_group.web: Read complete after 1s [id=sg-06d97327bc33be89f]
module.network.data.aws_security_group.data: Read complete after 1s [id=sg-0828a5e9cb1600b45]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]
module.network.data.aws_security_group.app: Read complete after 1s [id=sg-030ce2225515676fe]
data.aws_alb.main: Read complete after 1s [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:loadbalancer/app/default/3e03a4ab8a6517c3]
data.aws_alb_listener.front_end: Reading...
aws_budgets_budget.cost: Refreshing state... [id=374838549618:startup-sample-monthly]
data.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:listener/app/default/3e03a4ab8a6517c3/c3c33be2ff30f44a]
module.network.data.aws_vpc.main: Read complete after 1s [id=vpc-0e24057e419d05560]
module.network.data.aws_subnet_ids.web: Reading...
module.network.data.aws_subnet_ids.app: Reading...
module.network.data.aws_subnet_ids.data: Reading...
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0f4d266f70e30c514]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:targetgroup/sample-target-group/088c51af1dc301de]
module.network.data.aws_subnet_ids.data: Read complete after 0s [id=vpc-0e24057e419d05560]
module.network.data.aws_subnet_ids.web: Read complete after 0s [id=vpc-0e24057e419d05560]
module.network.data.aws_subnet_ids.app: Read complete after 0s [id=vpc-0e24057e419d05560]
module.network.data.aws_subnet.data["subnet-0df5ca469df83ed54"]: Reading...
module.network.data.aws_subnet.web["subnet-038d1fdced9f62ff2"]: Reading...
module.network.data.aws_subnet.data["subnet-0ad3f7872fd1465c7"]: Reading...
module.network.data.aws_subnet.web["subnet-077a08c3f87316104"]: Reading...
module.network.data.aws_subnet.app["subnet-04522be55ef275393"]: Reading...
module.network.data.aws_subnet.app["subnet-0ba842de402aa0f23"]: Reading...
aws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:listener-rule/app/default/3e03a4ab8a6517c3/c3c33be2ff30f44a/0665d4b0e0fa3163]
aws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]
aws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]
module.network.data.aws_subnet.data["subnet-0df5ca469df83ed54"]: Read complete after 0s [id=subnet-0df5ca469df83ed54]
module.network.data.aws_subnet.web["subnet-077a08c3f87316104"]: Read complete after 0s [id=subnet-077a08c3f87316104]
aws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]
module.network.data.aws_subnet.data["subnet-0ad3f7872fd1465c7"]: Read complete after 0s [id=subnet-0ad3f7872fd1465c7]
module.network.data.aws_subnet.web["subnet-038d1fdced9f62ff2"]: Read complete after 0s [id=subnet-038d1fdced9f62ff2]
module.network.data.aws_subnet.app["subnet-04522be55ef275393"]: Read complete after 0s [id=subnet-04522be55ef275393]
aws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220901162801451000000002]
aws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]
module.network.data.aws_subnet.app["subnet-0ba842de402aa0f23"]: Read complete after 0s [id=subnet-0ba842de402aa0f23]
aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:374838549618:service/sample-cluster/sample-service]
aws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]
aws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]
aws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]
aws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]
aws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_budgets_budget.cost will be updated in-place
  ~ resource "aws_budgets_budget" "cost" {
        id                = "374838549618:startup-sample-monthly"
        name              = "startup-sample-monthly"
      ~ time_period_start = "2022-09-01_12:00" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:ca-central-1:374838549618:service/sample-cluster/sample-service"
        name                               = "sample-service"
        tags                               = {
            "Application" = "Startup Sample"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:374838549618:task-definition/sample-app-task:10" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.app[0] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:374838549618:task-definition/sample-app-task:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "442271020368.dkr.ecr.ca-central-1.amazonaws.com/ssp:c39374c77b81b65074f46da709c0940119574988" -> "442271020368.dkr.ecr.ca-central-1.amazonaws.com/ssp:"
                    name             = "sample-client-app"
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "sample-app-task" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "Application" = "Startup Sample"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_budgets_budget.cost,
│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":
│   19:   cost_filters = {
│   20:     TagKeyValue = "user:Project$Startup Sample"
│   21:   }
│ 
│ Use the attribute "cost_filter" instead.
│ 
│ (and 7 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.network.data.aws_subnet_ids.web,
│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":
│   31: data "aws_subnet_ids" "web" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and 5 more similar warnings elsewhere)
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.16160000000000048/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/m9tvhw-dev/runs/run-HBZv7G6UVGzgegvJ%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.2.6%0Aon linux_amd64%0AInitializing plugins and modules...%0Arandom_integer.cf_origin_id: Refreshing state... [id=44]%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-learning-tetra]%0Amodule.network.data.aws_security_group.web: Reading...%0Amodule.network.data.aws_security_group.app: Reading...%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:374838549618:cluster/sample-cluster]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Reading...%0Amodule.network.data.aws_vpc.main: Reading...%0Adata.aws_security_group.web: Reading...%0Amodule.network.data.aws_security_group.data: Reading...%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Adata.aws_caller_identity.current: Reading...%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]%0Adata.aws_alb.main: Reading...%0Adata.aws_caller_identity.current: Read complete after 0s [id=374838549618]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-learning-tetra]%0Amodule.network.data.aws_security_group.web: Read complete after 1s [id=sg-06d97327bc33be89f]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:374838549618:startup-sample-billing-alert-topic]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=ELQYSL4L90Q8Q]%0Adata.aws_security_group.web: Read complete after 1s [id=sg-06d97327bc33be89f]%0Amodule.network.data.aws_security_group.data: Read complete after 1s [id=sg-0828a5e9cb1600b45]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Amodule.network.data.aws_security_group.app: Read complete after 1s [id=sg-030ce2225515676fe]%0Adata.aws_alb.main: Read complete after 1s [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:loadbalancer/app/default/3e03a4ab8a6517c3]%0Adata.aws_alb_listener.front_end: Reading...%0Aaws_budgets_budget.cost: Refreshing state... [id=374838549618:startup-sample-monthly]%0Adata.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:listener/app/default/3e03a4ab8a6517c3/c3c33be2ff30f44a]%0Amodule.network.data.aws_vpc.main: Read complete after 1s [id=vpc-0e24057e419d05560]%0Amodule.network.data.aws_subnet_ids.web: Reading...%0Amodule.network.data.aws_subnet_ids.app: Reading...%0Amodule.network.data.aws_subnet_ids.data: Reading...%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0f4d266f70e30c514]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:targetgroup/sample-target-group/088c51af1dc301de]%0Amodule.network.data.aws_subnet_ids.data: Read complete after 0s [id=vpc-0e24057e419d05560]%0Amodule.network.data.aws_subnet_ids.web: Read complete after 0s [id=vpc-0e24057e419d05560]%0Amodule.network.data.aws_subnet_ids.app: Read complete after 0s [id=vpc-0e24057e419d05560]%0Amodule.network.data.aws_subnet.data["subnet-0df5ca469df83ed54"]: Reading...%0Amodule.network.data.aws_subnet.web["subnet-038d1fdced9f62ff2"]: Reading...%0Amodule.network.data.aws_subnet.data["subnet-0ad3f7872fd1465c7"]: Reading...%0Amodule.network.data.aws_subnet.web["subnet-077a08c3f87316104"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-04522be55ef275393"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-0ba842de402aa0f23"]: Reading...%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:listener-rule/app/default/3e03a4ab8a6517c3/c3c33be2ff30f44a/0665d4b0e0fa3163]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Amodule.network.data.aws_subnet.data["subnet-0df5ca469df83ed54"]: Read complete after 0s [id=subnet-0df5ca469df83ed54]%0Amodule.network.data.aws_subnet.web["subnet-077a08c3f87316104"]: Read complete after 0s [id=subnet-077a08c3f87316104]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Amodule.network.data.aws_subnet.data["subnet-0ad3f7872fd1465c7"]: Read complete after 0s [id=subnet-0ad3f7872fd1465c7]%0Amodule.network.data.aws_subnet.web["subnet-038d1fdced9f62ff2"]: Read complete after 0s [id=subnet-038d1fdced9f62ff2]%0Amodule.network.data.aws_subnet.app["subnet-04522be55ef275393"]: Read complete after 0s [id=subnet-04522be55ef275393]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220901162801451000000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Amodule.network.data.aws_subnet.app["subnet-0ba842de402aa0f23"]: Read complete after 0s [id=subnet-0ba842de402aa0f23]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:374838549618:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "374838549618:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-09-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A      ~ desired_count                      = 1 -> 2%0A        id                                 = "arn:aws:ecs:ca-central-1:374838549618:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:374838549618:task-definition/sample-app-task:10" -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:374838549618:task-definition/sample-app-task:10" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                  ~ image            = "442271020368.dkr.ecr.ca-central-1.amazonaws.com/ssp:c39374c77b81b65074f46da709c0940119574988" -> "442271020368.dkr.ecr.ca-central-1.amazonaws.com/ssp:"%0A                    name             = "sample-client-app"%0A                    # (8 unchanged elements hidden)%0A                } # forces replacement,%0A            ]%0A        )%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A      ~ revision                 = 10 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A╷%0A│ Warning: Argument is deprecated%0A│ %0A│   with aws_budgets_budget.cost,%0A│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A│   19:   cost_filters = {%0A│   20:     TagKeyValue = "user:Project$Startup Sample"%0A│   21:   }%0A│ %0A│ Use the attribute "cost_filter" instead.%0A│ %0A│ (and 7 more similar warnings elsewhere)%0A╵%0A╷%0A│ Warning: Deprecated Resource%0A│ %0A│   with module.network.data.aws_subnet_ids.web,%0A│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A│   31: data "aws_subnet_ids" "web" {%0A│ %0A│ The aws_subnet_ids data source has been deprecated and will be removed in a%0A│ future version. Use the aws_subnets data source instead.%0A│ %0A│ (and 5 more similar warnings elsewhere)%0A╵%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.16160000000000048/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/m9tvhw-dev/runs/run-HBZv7G6UVGzgegvJ%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.2.6%0Aon linux_amd64%0AInitializing plugins and modules...%0Arandom_integer.cf_origin_id: Refreshing state... [id=44]%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-learning-tetra]%0Amodule.network.data.aws_security_group.web: Reading...%0Amodule.network.data.aws_security_group.app: Reading...%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:374838549618:cluster/sample-cluster]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Reading...%0Amodule.network.data.aws_vpc.main: Reading...%0Adata.aws_security_group.web: Reading...%0Amodule.network.data.aws_security_group.data: Reading...%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Adata.aws_caller_identity.current: Reading...%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]%0Adata.aws_alb.main: Reading...%0Adata.aws_caller_identity.current: Read complete after 0s [id=374838549618]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-learning-tetra]%0Amodule.network.data.aws_security_group.web: Read complete after 1s [id=sg-06d97327bc33be89f]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:374838549618:startup-sample-billing-alert-topic]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=ELQYSL4L90Q8Q]%0Adata.aws_security_group.web: Read complete after 1s [id=sg-06d97327bc33be89f]%0Amodule.network.data.aws_security_group.data: Read complete after 1s [id=sg-0828a5e9cb1600b45]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Amodule.network.data.aws_security_group.app: Read complete after 1s [id=sg-030ce2225515676fe]%0Adata.aws_alb.main: Read complete after 1s [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:loadbalancer/app/default/3e03a4ab8a6517c3]%0Adata.aws_alb_listener.front_end: Reading...%0Aaws_budgets_budget.cost: Refreshing state... [id=374838549618:startup-sample-monthly]%0Adata.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:listener/app/default/3e03a4ab8a6517c3/c3c33be2ff30f44a]%0Amodule.network.data.aws_vpc.main: Read complete after 1s [id=vpc-0e24057e419d05560]%0Amodule.network.data.aws_subnet_ids.web: Reading...%0Amodule.network.data.aws_subnet_ids.app: Reading...%0Amodule.network.data.aws_subnet_ids.data: Reading...%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0f4d266f70e30c514]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:targetgroup/sample-target-group/088c51af1dc301de]%0Amodule.network.data.aws_subnet_ids.data: Read complete after 0s [id=vpc-0e24057e419d05560]%0Amodule.network.data.aws_subnet_ids.web: Read complete after 0s [id=vpc-0e24057e419d05560]%0Amodule.network.data.aws_subnet_ids.app: Read complete after 0s [id=vpc-0e24057e419d05560]%0Amodule.network.data.aws_subnet.data["subnet-0df5ca469df83ed54"]: Reading...%0Amodule.network.data.aws_subnet.web["subnet-038d1fdced9f62ff2"]: Reading...%0Amodule.network.data.aws_subnet.data["subnet-0ad3f7872fd1465c7"]: Reading...%0Amodule.network.data.aws_subnet.web["subnet-077a08c3f87316104"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-04522be55ef275393"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-0ba842de402aa0f23"]: Reading...%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:374838549618:listener-rule/app/default/3e03a4ab8a6517c3/c3c33be2ff30f44a/0665d4b0e0fa3163]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Amodule.network.data.aws_subnet.data["subnet-0df5ca469df83ed54"]: Read complete after 0s [id=subnet-0df5ca469df83ed54]%0Amodule.network.data.aws_subnet.web["subnet-077a08c3f87316104"]: Read complete after 0s [id=subnet-077a08c3f87316104]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Amodule.network.data.aws_subnet.data["subnet-0ad3f7872fd1465c7"]: Read complete after 0s [id=subnet-0ad3f7872fd1465c7]%0Amodule.network.data.aws_subnet.web["subnet-038d1fdced9f62ff2"]: Read complete after 0s [id=subnet-038d1fdced9f62ff2]%0Amodule.network.data.aws_subnet.app["subnet-04522be55ef275393"]: Read complete after 0s [id=subnet-04522be55ef275393]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220901162801451000000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Amodule.network.data.aws_subnet.app["subnet-0ba842de402aa0f23"]: Read complete after 0s [id=subnet-0ba842de402aa0f23]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:374838549618:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "374838549618:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-09-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A      ~ desired_count                      = 1 -> 2%0A        id                                 = "arn:aws:ecs:ca-central-1:374838549618:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:374838549618:task-definition/sample-app-task:10" -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:374838549618:task-definition/sample-app-task:10" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                  ~ image            = "442271020368.dkr.ecr.ca-central-1.amazonaws.com/ssp:c39374c77b81b65074f46da709c0940119574988" -> "442271020368.dkr.ecr.ca-central-1.amazonaws.com/ssp:"%0A                    name             = "sample-client-app"%0A                    # (8 unchanged elements hidden)%0A                } # forces replacement,%0A            ]%0A        )%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A      ~ revision                 = 10 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A╷%0A│ Warning: Argument is deprecated%0A│ %0A│   with aws_budgets_budget.cost,%0A│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A│   19:   cost_filters = {%0A│   20:     TagKeyValue = "user:Project$Startup Sample"%0A│   21:   }%0A│ %0A│ Use the attribute "cost_filter" instead.%0A│ %0A│ (and 7 more similar warnings elsewhere)%0A╵%0A╷%0A│ Warning: Deprecated Resource%0A│ %0A│   with module.network.data.aws_subnet_ids.web,%0A│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A│   31: data "aws_subnet_ids" "web" {%0A│ %0A│ The aws_subnet_ids data source has been deprecated and will be removed in a%0A│ future version. Use the aws_subnets data source instead.%0A│ %0A│ (and 5 more similar warnings elsewhere)%0A╵%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.16160000000000048/mo +$0.0%0A

::set-output name=stderr::

::set-output name=exitcode::0

```
</details>
#### Architecture Diagram

![img](null)
*Pusher:* @crochcunill, *Action:* [Pull Request: #3](https://github.com/crochcunill/startup-sample-project-aws-containers/actions/runs/3381452994)